main: Adam software design
